//在一次游泳比赛后，记者让5名参数选手分别预测一下自己的名次
//结果，每名选手只说对了一半
//A选手说：B第二，我第三
//B选手说：我第二，E第四
//C选手说：我第一，D第二
//D选手说：C最后，我第三
//E选手说：我第四，A第一
#include <stdio.h>
int main()
{
	int A, B, C, D, E;
	for (A = 1; A <= 5; A++)//从A是第一名开始假设
	{
		for (B = 1; B <= 5; B++)
		{
			if (B == A)continue;//如果后面有名次和前面重复，则跳过
			for (C = 1; C <= 5; C++)
			{
				if ((C == A) || (C == B))continue;
				for (D = 1; D <= 5; D++)
				{
					if ((D == C) || (D == B) || (D == A))continue;
					for (E = 1; E <= 5; E++)
					{
						if ((E == D) || (E == C) || (E == B) || (E == A))continue;
						if (((B == 2) + (A == 3) == 1)//如果接下来每个人说对了一半
							&& ((B == 2) + (E == 4) == 1)
							&& ((C == 1) + (D == 2) == 1)
							&& ((C == 5) + (D == 3) == 1)
							&& ((E == 4) + (A == 1) == 1))
							printf("A是第%d名\nB是第%d名\nC是第%d名\nD是第%d名\nE是第%d名\n", A, B, C, D, E);
					}
				}
			}
		}
	}
	return 0;
}